package page;

import com.android.uiautomator.testrunner.UiAutomatorTestCase;

public class OrderPushPage extends UiAutomatorTestCase {
	//判断关闭按钮是否存在
	//点击关闭按钮
	//判断订单类型图标是否存在
	//判断订单类型
	//订单类型是否存在
	//判断订单颜色
	//推送详情页应该可以滚动
	//获取用车时间
	//判断用车时间是否存在
	//获取用车距离
	//判断用车距离是否存在
	//获取上车地点
	//判断上车地点是否存在
	//获取上车地点详情
	//判断上车地点详情是否存在
	//获取上车地点TIP
	//判断上车地点TIP是否存在
	//获取下车地点
	//判断下车地点是否存在
	//获取下车地点详情
	//判断下车地点详情是否存在
	//获取下车地点TIP
	//判断下车地点TIP是否存在
	//获取特别提示
	//判断特别提示是否存在
	//获取特别提示TIP
	//判断特别提示TIP是否存在
	//获取向上滑动地图文本
	//判断向上滑动地图问题是否存在
	//获取确定按钮文本
	//判断确定按钮是否存在
	//点击确定按钮
	//获取接单设置按钮文本
	//判断接单设置按钮是否存在
	//点击接单设置按钮
	//获取备注信息
	//判断备注是否存在
	//获取备注TIP
	//判断备注TIP是否存在
	//获取浮动系数信息
	//判断浮动系数是否存在

}
